Revit 2024 API
FailureDefinition.Severity Property
 The severity of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailureSeverity Severity { get; }
Visual Basic
Public ReadOnly Property Severity As FailureSeverity
	Get
Visual C++
public:
property FailureSeverity Severity {
	FailureSeverity get ();
}
See Also
FailureDefinition Class
Autodesk.Revit.DB Namespace